zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommi2cc.h
/* UNICOMMI2CC_DMA_TRIG0_ISET Bits */
/* UNICOMMI2CC_DMA_TRIG0_ISET[TXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG0_ISET_TXTRG_OFS     (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG0_ISET_TXTRG_MASK    ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_DMA_TRIG0_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG0_ISET_TXTRG_SET     ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG1_IMASK Bits */
/* UNICOMMI2CC_DMA_TRIG1_IMASK[RXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG1_IMASK_RXTRG_OFS    (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG1_IMASK_RXTRG_MASK   ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_DMA_TRIG1_IMASK_RXTRG_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG1_IMASK_RXTRG_SET    ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG1_RIS Bits */
/* UNICOMMI2CC_DMA_TRIG1_RIS[RXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG1_RIS_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG1_RIS_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, trigger when RX FIFO
                                                                                    contains >= defined bytes
                                                                                    when FIFO is not present, this
                                                                                    indicates when buffer is full */
#define UNICOMMI2CC_DMA_TRIG1_RIS_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG1_RIS_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG1_MIS Bits */
/* UNICOMMI2CC_DMA_TRIG1_MIS[RXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG1_MIS_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG1_MIS_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_DMA_TRIG1_MIS_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG1_MIS_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG1_ISET Bits */
/* UNICOMMI2CC_DMA_TRIG1_ISET[RXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG1_ISET_RXTRG_OFS     (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG1_ISET_RXTRG_MASK    ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_DMA_TRIG1_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG1_ISET_RXTRG_SET     ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_IIDX Bits */
/* UNICOMMI2CC_IIDX[STAT] Bits */
#define UNICOMMI2CC_IIDX_STAT_OFS                (0)                             /* !< STAT Offset */
#define UNICOMMI2CC_IIDX_STAT_MASK               ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define UNICOMMI2CC_IIDX_STAT_NO_INTR            ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UNICOMMI2CC_IIDX_STAT_RXDONEFG           ((uint32_t)0x00000001U)         /* !< Data received */
#define UNICOMMI2CC_IIDX_STAT_TXDONEFG           ((uint32_t)0x00000002U)         /* !< data transmitted */
#define UNICOMMI2CC_IIDX_STAT_RXTRG              ((uint32_t)0x00000003U)         /* !< Receive Trigger */
#define UNICOMMI2CC_IIDX_STAT_TXTRG              ((uint32_t)0x00000004U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_IIDX_STAT_RXFULL             ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define UNICOMMI2CC_IIDX_STAT_TXEMPTY            ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define UNICOMMI2CC_IIDX_STAT_NACKFG             ((uint32_t)0x00000008U)         /* !< Address/Data NACK */
#define UNICOMMI2CC_IIDX_STAT_STARTFG            ((uint32_t)0x00000009U)         /* !< Start Event */
#define UNICOMMI2CC_IIDX_STAT_STOPFG             ((uint32_t)0x0000000AU)         /* !< Stop Event */
#define UNICOMMI2CC_IIDX_STAT_ARBLOSTFG          ((uint32_t)0x0000000BU)         /* !< Arbitration Lost */
#define UNICOMMI2CC_IIDX_STAT_PEC_RX_ERR         ((uint32_t)0x0000000CU)         /* !< PEC Receive Error Event */
#define UNICOMMI2CC_IIDX_STAT_TIMEOUTA           ((uint32_t)0x0000000DU)         /* !< Timeout A Event */
#define UNICOMMI2CC_IIDX_STAT_TIMEOUTB           ((uint32_t)0x0000000EU)         /* !< Timeout B Event */
#define UNICOMMI2CC_IIDX_STAT_DMA_DONE_RX        ((uint32_t)0x00000010U)         /* !< DMA DONE on Channel RX */
#define UNICOMMI2CC_IIDX_STAT_DMA_DONE_TX        ((uint32_t)0x00000011U)         /* !< DMA DONE on Channel TX */
#define UNICOMMI2CC_IIDX_STAT_DMA_PREIRQ_RX      ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define UNICOMMI2CC_IIDX_STAT_DMA_PREIRQ_TX      ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

/* UNICOMMI2CC_CPU_INT_IMASK Bits */
/* UNICOMMI2CC_CPU_INT_IMASK[RXDONE] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_RXDONE_OFS     (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_RXDONE_MASK    ((uint32_t)0x00000001U)         /* !< RXDONE interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_RXDONE_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_RXDONE_SET     ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[TIMEOUTA] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTA_OFS   (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTA_MASK  ((uint32_t)0x00001000U)         /* !< TIMEOUTA interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTA_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTA_SET   ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[NACK] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_NACK_OFS       (7)                             /* !< NACK Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_NACK_MASK      ((uint32_t)0x00000080U)         /* !< NACK interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_NACK_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_NACK_SET       ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[START] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_START_OFS      (8)                             /* !< START Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_START_MASK     ((uint32_t)0x00000100U)         /* !< START interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_START_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_START_SET      ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[STOP] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_STOP_OFS       (9)                             /* !< STOP Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_STOP_MASK      ((uint32_t)0x00000200U)         /* !< STOP interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_STOP_CLR       ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_STOP_SET       ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[ARBLOST] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_ARBLOST_OFS    (10)                            /* !< ARBLOST Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_ARBLOST_MASK   ((uint32_t)0x00000400U)         /* !< Arbitration Lost interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_ARBLOST_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_ARBLOST_SET    ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[TXDONE] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_TXDONE_OFS     (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_TXDONE_MASK    ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_TXDONE_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_TXDONE_SET     ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[RXTRG] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_CPU_INT_IMASK_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[TXTRG] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_CPU_INT_IMASK_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[DMA_DONE_TX] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[DMA_DONE_RX] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[PEC_RX_ERR] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[TIMEOUTB] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTB_OFS   (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTB_MASK  ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTB_CLR   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_TIMEOUTB_SET   ((uint32_t)0x00002000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< DMA Done PREIRQ RX interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_RX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< DMA Done PREIRQ TX interrupt */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_TX_CLR ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_IMASK_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[RXFULL] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_RXFULL_OFS     (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_RXFULL_MASK    ((uint32_t)0x00000010U)         /* !< RXFIFO full event */
#define UNICOMMI2CC_CPU_INT_IMASK_RXFULL_CLR     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_RXFULL_SET     ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_IMASK[TXEMPTY] Bits */
#define UNICOMMI2CC_CPU_INT_IMASK_TXEMPTY_OFS    (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CC_CPU_INT_IMASK_TXEMPTY_MASK   ((uint32_t)0x00000020U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    interrupt. */
#define UNICOMMI2CC_CPU_INT_IMASK_TXEMPTY_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_IMASK_TXEMPTY_SET    ((uint32_t)0x00000020U)         /* !< Set Interrupt Mask */

