zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommi2cc.h
/* UNICOMMI2CC_PECCTL Bits */
/* UNICOMMI2CC_PECCTL[PECCNT] Bits */
#define UNICOMMI2CC_PECCTL_PECCNT_OFS            (0)                             /* !< PECCNT Offset */
#define UNICOMMI2CC_PECCTL_PECCNT_MASK           ((uint32_t)0x000001FFU)         /* !< PEC Count When this field is non
                                                                                    zero, the number of I2C bytes are
                                                                                    counted (Note that although the PEC
                                                                                    is calculated on the I2C address it
                                                                                    is not counted at a byte). When the
                                                                                    byte count = PECCNT and the state
                                                                                    machine is transmitting, the contents
                                                                                    of the LSFR is loaded into the shift
                                                                                    register instead of the byte received
                                                                                    from the Tx FIFO. When the state
                                                                                    machine is receiving, after the last
                                                                                    bit of this byte is received the LSFR
                                                                                    is checked and if it is non-zero, a
                                                                                    PEC RX Error interrupt is generated.
                                                                                    The I2C packet must be padded to
                                                                                    include the PEC byte for both
                                                                                    transmit and receive. In transmit
                                                                                    mode the FIFO must be loaded with a
                                                                                    dummy PEC byte. In receive mode the
                                                                                    PEC byte will be passed to the Rx
                                                                                    FIFO.  In the normal Controller use
                                                                                    case, FW would set PECEN=1 and
                                                                                    PECCNT=SMB packet length (Not
                                                                                    including Target Address byte, but
                                                                                    including the PEC byte). FW would
                                                                                    then configure DMA to allow the
                                                                                    packet to complete unassisted and
                                                                                    write MCTR to initiate the
                                                                                    transaction.  Note that when the byte
                                                                                    count = PEC CNT, the byte count is
                                                                                    reset to 0 and multiple PEC
                                                                                    calculation can automatically occur
                                                                                    within a single I2C transaction.
                                                                                    Note that any write to the I2PECCTL
                                                                                    Register will clear the current PEC
                                                                                    Byte Count in the State Machine. */
#define UNICOMMI2CC_PECCTL_PECCNT_MINIMUM        ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define UNICOMMI2CC_PECCTL_PECCNT_MAXIMUM        ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* UNICOMMI2CC_PECCTL[PECEN] Bits */
#define UNICOMMI2CC_PECCTL_PECEN_OFS             (12)                            /* !< PECEN Offset */
#define UNICOMMI2CC_PECCTL_PECEN_MASK            ((uint32_t)0x00001000U)         /* !< PEC Enable This bit enables the SMB
                                                                                    Packet Error Checking (PEC). When
                                                                                    enabled the PEC is calculated on all
                                                                                    bits except the Start, Stop, Ack and
                                                                                    Nack. The PEC LSFR and the Byte
                                                                                    Counter is set to 0 when the State
                                                                                    Machine is in the IDLE state, which
                                                                                    occur following a Stop or when a
                                                                                    timeout occurs. The Counter is also
                                                                                    set to 0 after the PEC byte is sent
                                                                                    or received. Note that the NACK is
                                                                                    automatically send following a PEC
                                                                                    byte that results in a PEC error. The
                                                                                    PEC Polynomial is x^8 + x^2 + x^1 +
                                                                                    1. */
#define UNICOMMI2CC_PECCTL_PECEN_DISABLE         ((uint32_t)0x00000000U)         /* !< PEC is disabled */
#define UNICOMMI2CC_PECCTL_PECEN_ENABLE          ((uint32_t)0x00001000U)         /* !< PEC is enabled */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_unicommi2cc__include */
